; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v6 - type_1 ?v7 - type_2)
 	      (pred_1 ?v5 - object ?v7 - type_2)
	      (pred_4 ?v6 - type_1 ?v2 - type_3)
	      (pred_2 ?v6 - type_1 ?v5 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v6 - type_1 ?v4 ?v1 - type_2)
       :precondition (and  (pred_3 ?v6 ?v4))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_1 ?v8 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v3) (pred_3 ?v6 ?v3) (pred_4 ?v6 ?v2))
       :effect (and (pred_2 ?v6 ?v8 ?v2)
		    (not (pred_1 ?v8 ?v3)) 
		    (not (pred_4 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_1 ?v8 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v8 ?v2) (pred_3 ?v6 ?v3))
       :effect (and (pred_1 ?v8 ?v3)
		    (pred_4 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v8 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_10 - type_1
obj_09 obj_08 obj_13 obj_11 - type_3
obj_04 obj_05 obj_02 obj_14 - type_2
obj_06 obj_12 obj_01 obj_07 - object)
(:init
(pred_3 obj_03 obj_02)
(pred_4 obj_03 obj_09)
(pred_4 obj_03 obj_08)
(pred_3 obj_10 obj_04)
(pred_4 obj_10 obj_13)
(pred_4 obj_10 obj_11)
(pred_1 obj_06 obj_14)
(pred_1 obj_12 obj_14)
(pred_1 obj_01 obj_04)
(pred_1 obj_07 obj_04)
)
(:goal
(and
(pred_1 obj_06 obj_04)
(pred_1 obj_12 obj_14)
(pred_1 obj_01 obj_14)
(pred_1 obj_07 obj_14)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_03 obj_14) (pred_3 obj_10 obj_14))))
  )
)
)

; plan
1. (op_1 obj_03 obj_02 obj_04)
   deleted: (pred_3 obj_03 obj_02)
   added: (pred_3 obj_03 obj_04)
   goals met: 1 of 4
2. (op_2 obj_10 obj_07 obj_04 obj_11)
   deleted: (pred_1 obj_07 obj_04) (pred_4 obj_10 obj_11)
   added: (pred_2 obj_10 obj_07 obj_11)
   goals met: 1 of 4
3. (op_2 obj_10 obj_01 obj_04 obj_13)
   deleted: (pred_1 obj_01 obj_04) (pred_4 obj_10 obj_13)
   added: (pred_2 obj_10 obj_01 obj_13)
   goals met: 1 of 4
4. (op_1 obj_10 obj_04 obj_14)
   deleted: (pred_3 obj_10 obj_04)
   added: (pred_3 obj_10 obj_14)
   goals met: 1 of 4
5. (op_3 obj_10 obj_07 obj_14 obj_11)
   deleted: (pred_2 obj_10 obj_07 obj_11)
   added: (pred_1 obj_07 obj_14) (pred_4 obj_10 obj_11)
   goals met: 2 of 4
6. (op_3 obj_10 obj_01 obj_14 obj_13)
   deleted: (pred_2 obj_10 obj_01 obj_13)
   added: (pred_1 obj_01 obj_14) (pred_4 obj_10 obj_13)
   goals met: 3 of 4
7. (op_2 obj_10 obj_06 obj_14 obj_11)
   deleted: (pred_1 obj_06 obj_14) (pred_4 obj_10 obj_11)
   added: (pred_2 obj_10 obj_06 obj_11)
   goals met: 3 of 4
8. (op_1 obj_10 obj_14 obj_04)
   deleted: (pred_3 obj_10 obj_14)
   added: (pred_3 obj_10 obj_04)
   goals met: 3 of 4
9. (op_3 obj_10 obj_06 obj_04 obj_11)
   deleted: (pred_2 obj_10 obj_06 obj_11)
   added: (pred_1 obj_06 obj_04) (pred_4 obj_10 obj_11)
   goals met: 4 of 4
